//Техологично училище Електронни системи към ТУ София
//11 А
//22
//Николай Тихомиров Коцев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +?) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +?) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.


#include <stdio.h>
int scanx(){
    int x,i,bol;
    do{
    printf("Enter x: ");
    scanf("%d",&x);
    if ((x<0)||(x>9)){
       bol=0;
       printf("X must be larger 0 and smaller than 10");               
       }       
       else bol = 1;
    }while (bol!=1);
    return x;
    }
    
    
int main(){
    int x,arr[10],narr[10],i=1,count;
    x=scanx();
    for (count=0;count<10;count++){
          while (1){
                if ((i%x)==0){
                   narr[count]=i;
                   i++;
                   break;
                }
                i++;    
             } 
          }
    for (i=0;i<=9;i++){
        for (count=0;count<=narr[i];count++){
            arr[i]=arr[i] + count;
            }
        
        
        
        }
    for (i=0;i<=9;i++){
        printf("Element %d = %d\n",i,arr[i]);
        }          
    system("PAUSE");
    return 0;
    }
