//Техологично училище Електронни системи към ТУ София
//11 А
//22
//Николай Тихомиров Коцев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.


#include<stdio.h>

int main(){
    int x=0,i=0,ic=0;
    long int arr[9],sum=0;
    do{
    printf("Enter x:");
    scanf("%d",&x);
    }
    while ((x<1)||(x>10));
    for (i=0;i<=9;i++){
        for (ic=0;ic<1000;ic++){
            if ((ic%((i+1)*x))==0){
              sum+=ic;
              }             
        }
    arr[i]=sum;
    }
    for (i=0;i<=9;i++){
        printf("Element %d : %d\n",i,arr[i]);
        }
    system("Pause");
    return 0;
}
    
