//Техологично училище Електронни системи към ТУ София
//11 А
//22
//Николай Тихомиров Коцев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +?) завършващо на x и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0;  +?) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +?) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
#include <stdio.h>
#include <math.h>
#define SIZE 10

int isprime(int cp){
	int i,bol=1;
	for (i=2;i<=cp;i++){
		if((cp%i)==0){
		bol=1;
		break;
		}
	}
	return bol;
	}

int main(){
    int x,i=2,ic=0,bol=1,arr[SIZE];

    double root;
    do{
    printf("Enter x:");
    scanf("%d",&x);
    }
    while ((x<0)||(x>SIZE));
	for (ic=0;ic<SIZE;ic++){
    	bol = 1;
    	while(bol==1){
    		if((isprime(i))&&((i%x)==0)){
    			arr[ic]==i;
    			i++;
	    			bol=0;
    			}
    		i++;	
    		}    
     	}
     	
    
    
    for (i=0;i<SIZE;i++) printf("Element %d = %d \n",i,arr[i]);
    
    
    
    system("PAUSE");
    return 0;
    }
