//Техологично училище Електронни системи към ТУ София
//11 А
//22
//Николай Тихомиров Коцев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +?) завършващо на x и да се запише като първи елемент в масива. Да се намери второто число на Фибоначи в интервала [0;  +?) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +?) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
#include <stdio.h>
#define SIZE 9

int main(){
    int x,i=0;
    long int arr[SIZE],a=0,b=1,c=0;
    do{
    printf("Enter x:");
    scanf("%d",&x);
    }
    while ((x<0)||(x>10));
    while (i<=SIZE){
          c=a+b;
          a=b;
          b=c;   
          if ((c%10)== x){
              arr[i]=c;
              i++;        
              }                     
          }
    for (i=0;i<=SIZE;i++){
        printf("Element %d = %ld \n",i,arr[i]);
        }       
    return 0;
    }
